#include <stdio.h>
// Калькулятор депозита
// В кассу на трехпроцентный вклад положили X usd.Какой станет сумма вклада через N лет и
// какой будет чистый доход.

int main()
{
    int x;
    int n;
    int s;
    int d = 0;
    printf("Введіть суму депозиту:");
    scanf("%d", &x);
    printf("Введіть кількість років:");
    scanf("%d", &n);
    if ((x >= 0 && x <= 1000000) && (n >= 0 && n <= 10000))
    {

        d = x * (1 + 0.03 * n);
         s = d - x;
    }
    printf("Сума вкладу чере %d років: %d \n", s, d);
    printf("Чистий дохід: %d \n", s);

    return 0;
}